; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_3 type_2)
 (:predicates (pred_1 ?v5 - type_3 ?v1 - type_1)
 	      (pred_4 ?v2 - object ?v1 - type_1)
	      (pred_2 ?v5 - type_3 ?v3 - type_2)
	      (pred_3 ?v5 - type_3 ?v2 - object ?v3 - type_2))

   (:action op_3
       :parameters  (?v5 - type_3 ?v8 ?v7 - type_1)
       :precondition (and  (pred_1 ?v5 ?v8))
       :effect (and  (pred_1 ?v5 ?v7)
		     (not (pred_1 ?v5 ?v8))))

   (:action op_2
       :parameters (?v5 - type_3 ?v4 - object ?v6 - type_1 ?v3 - type_2)
       :precondition  (and  (pred_4 ?v4 ?v6) (pred_1 ?v5 ?v6) (pred_2 ?v5 ?v3))
       :effect (and (pred_3 ?v5 ?v4 ?v3)
		    (not (pred_4 ?v4 ?v6)) 
		    (not (pred_2 ?v5 ?v3))))

   (:action op_1
       :parameters (?v5 - type_3 ?v4 - object ?v6 - type_1 ?v3 - type_2)
       :precondition  (and  (pred_3 ?v5 ?v4 ?v3) (pred_1 ?v5 ?v6))
       :effect (and (pred_4 ?v4 ?v6)
		    (pred_2 ?v5 ?v3)
		    (not (pred_3 ?v5 ?v4 ?v3)))))

; problem
(define (problem gripper-2-4-4)
(:domain gripper-strips)
(:objects obj_01 obj_02 - type_3
obj_10 obj_08 obj_05 obj_07 - type_2
obj_03 obj_14 obj_04 obj_06 - type_1
obj_09 obj_13 obj_11 obj_12 - object)
(:init
(pred_1 obj_01 obj_03)
(pred_2 obj_01 obj_10)
(pred_2 obj_01 obj_08)
(pred_1 obj_02 obj_06)
(pred_2 obj_02 obj_05)
(pred_2 obj_02 obj_07)
(pred_4 obj_09 obj_06)
(pred_4 obj_13 obj_04)
(pred_4 obj_11 obj_14)
(pred_4 obj_12 obj_14)
)
(:goal
(and
(pred_4 obj_09 obj_14)
(pred_4 obj_13 obj_06)
(pred_4 obj_11 obj_04)
(pred_4 obj_12 obj_14)
)
)

(:constraints
  (always (not (pred_1 obj_01 obj_04)))
)
)

; plan
1. (op_3 obj_01 obj_03 obj_14)
   deleted: (pred_1 obj_01 obj_03)
   added: (pred_1 obj_01 obj_14)
   goals met: 1 of 4
2. (op_2 obj_02 obj_09 obj_06 obj_07)
   deleted: (pred_4 obj_09 obj_06) (pred_2 obj_02 obj_07)
   added: (pred_3 obj_02 obj_09 obj_07)
   goals met: 1 of 4
3. (op_3 obj_02 obj_06 obj_14)
   deleted: (pred_1 obj_02 obj_06)
   added: (pred_1 obj_02 obj_14)
   goals met: 1 of 4
4. (op_2 obj_01 obj_11 obj_14 obj_08)
   deleted: (pred_4 obj_11 obj_14) (pred_2 obj_01 obj_08)
   added: (pred_3 obj_01 obj_11 obj_08)
   goals met: 1 of 4
5. (op_1 obj_02 obj_09 obj_14 obj_07)
   deleted: (pred_3 obj_02 obj_09 obj_07)
   added: (pred_4 obj_09 obj_14) (pred_2 obj_02 obj_07)
   goals met: 2 of 4
6. (op_3 obj_01 obj_14 obj_06)
   deleted: (pred_1 obj_01 obj_14)
   added: (pred_1 obj_01 obj_06)
   goals met: 2 of 4
7. (op_3 obj_02 obj_14 obj_03)
   deleted: (pred_1 obj_02 obj_14)
   added: (pred_1 obj_02 obj_03)
   goals met: 2 of 4
8. (op_1 obj_01 obj_11 obj_06 obj_08)
   deleted: (pred_3 obj_01 obj_11 obj_08)
   added: (pred_4 obj_11 obj_06) (pred_2 obj_01 obj_08)
   goals met: 2 of 4
9. (op_3 obj_02 obj_03 obj_04)
   deleted: (pred_1 obj_02 obj_03)
   added: (pred_1 obj_02 obj_04)
   goals met: 2 of 4
10. (op_2 obj_02 obj_13 obj_04 obj_07)
   deleted: (pred_4 obj_13 obj_04) (pred_2 obj_02 obj_07)
   added: (pred_3 obj_02 obj_13 obj_07)
   goals met: 2 of 4
11. (op_3 obj_02 obj_04 obj_06)
   deleted: (pred_1 obj_02 obj_04)
   added: (pred_1 obj_02 obj_06)
   goals met: 2 of 4
12. (op_1 obj_02 obj_13 obj_06 obj_07)
   deleted: (pred_3 obj_02 obj_13 obj_07)
   added: (pred_4 obj_13 obj_06) (pred_2 obj_02 obj_07)
   goals met: 3 of 4
13. (op_2 obj_02 obj_11 obj_06 obj_07)
   deleted: (pred_4 obj_11 obj_06) (pred_2 obj_02 obj_07)
   added: (pred_3 obj_02 obj_11 obj_07)
   goals met: 3 of 4
14. (op_3 obj_02 obj_06 obj_04)
   deleted: (pred_1 obj_02 obj_06)
   added: (pred_1 obj_02 obj_04)
   goals met: 3 of 4
15. (op_1 obj_02 obj_11 obj_04 obj_07)
   deleted: (pred_3 obj_02 obj_11 obj_07)
   added: (pred_4 obj_11 obj_04) (pred_2 obj_02 obj_07)
   goals met: 4 of 4
